[
  "obsidian-linter",
  "obsidian-git",
  "obsidian-tasks-plugin",
  "table-editor-obsidian",
  "update-time-on-edit",
  "obsidian-file-cleaner",
  "dbfolder",
  "obsidian-projects",
  "obsidian-style-settings",
  "templater-obsidian",
  "dataview",
  "obsidian-footnotes",
  "obsidian-excalidraw-plugin"
]